helloRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:service="http://hamendi.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <service:getHelloMsg>
            <name>hamendi</name>
        </service:getHelloMsg>
    </soapenv:Body>
</soapenv:Envelope>

